<template>
  <v-row no-gutters class="flex-column fill-height">
    <div class="d-flex justify-end pt-3">
      <v-btn text color="primary" class="text-none caption" style=" font-family: 'Montserrat', sans-serif !important;">Switch to English</v-btn>
    </div>
    <v-col class="pt-3 d-flex flex-column">
      <v-content
        id="scroll-target"
        ref="scrolledArea"
        :style="{
        'max-height':max+'px',
        'position':'relative'
      }"
        class="overflow-y-auto px-5"
      >
        <v-row no-gutters>
          <v-col>
            <h4>Условия пользования сервисом</h4>
            <div class="mt-3">
              <p>1. Сайт предназначен для использования исключительно в личных некоммерческих целях. Пользователь обязан пользоваться Сайтом в предназначенных целях и в порядке, определенном Соглашением.</p>
              <p>2. Пользователь не может передавать свое право пользования Сайтом третьим лицам ни при каких обстоятельствах, а также не имеет права разглашать информацию о своих логине и/или пароле как конкретным лицам, так и неограниченному кругу лиц.</p>
              <p>3. Для получения доступа к Сайту и пользования им необходимо пройти процедуру Регистрации на Сайте. Прохождение регистрации может включать в себя:
                <div class="pl-3">
                 <p>
                   3.1 указание персональных данных: ФИО, даты рождения, паспортных данных, страны принадлежности, мобильного телефона, электронной почты, адреса и иных данных, запрошенных Администрацией;
                  </p>
                  <p>
                    3.2 формирование пары логин/пароль;
                    </p>
                    <p>
подтверждение достижения возраста, равного или превышающего 18 лет, а также принятие и согласие с условиями настоящего Пользовательского Соглашения и Политикой Конфиденциальности (Приложение №1), а также условиями и порядком обработки персональных данных;
                      </p>
                  <p> 3.3 идентификацию Пользователя по предоставленной Пользователем фотографии; </p>
                  <p> 3.4 авторизацию указанных данных. </p>
                  </div>
              </p>
              <p>4. После прохождения процедуры Регистрации Пользователь полностью принимает условия настоящего Соглашения, обязуется действовать в соответствии с его условиями, независимо от того, кем осуществлялись действия с использованием его пары логин/пароль, будут считаться действиями, совершенными Пользователем.
                 <div class="pl-3">
                   <p> 4.1 Все условия настоящего Соглашения распространяются на лица, посетившие Сайт, независимо от прохождения процедуры Регистрации при каждом посещении Сайта. </p> </div> 
              </p>
              <p>5. После прохождения Регистрации лицо становится Пользователем Сайта в смысле, определенном настоящим Соглашением.</p>
              <p>6. После прохождения Регистрации Пользователь получает уникальную пару логин/пароль, предоставляющую доступ к Сайту и его услугам. Пользователь обязуется ни при каких обстоятельствах не сообщать логин/пароль третьим лицам и несет полную ответственность за действия совершенные с использованием его логина и/или пароля.</p>
              <p>7. Прохождение Регистрации может включать в себя процедуру подтверждения указанных Пользователем данных с помощью использования технических средств и ресурсов Сайта с целью идентификации Пользователя в качестве конкретного лица.</p>
              <p>8. Проходя Регистрацию, Пользователь автоматически подтверждает достоверность указанных им данных и принимает все связанные с этим риски.</p>
              <p>9. Пользователь обязуется не использовать Сайт для:
                <div class="pl-3">
                  <p> 9.1 Осуществления коммерческих целей и предпринимательской деятельности. </p>
                  <p> 9.2 Рассылки массовых сообщений, электронных писем, а также использовать в этих целях информацию, полученную на сайте. </p>
                  <p> 9.3 Совершения сделок – коммерческих и некоммерческих – с другими Пользователями, без предварительного согласия Администрации, а также предложения другим Пользователям совершать сделки, передавать товары, осуществлять работ, оказывать услуги.</p>
                  <p> 9.4 Рекламы товаров и услуг, совершения оферты, предложения Пользователям совершить какие-либо действия в пользу третьих лиц.</p>
                </div>               
              </p>
              <p>10. При пользовании Сайтом запрещено:
                <div class="pl-3">
                  <p>10.1 Нарушение прав собственников Сайта, Администрации и третьих лиц на объекты интеллектуальной собственности:</p>
                  <p>10.2 Распространение сообщений, содержащих вредоносные объекты, компьютерные вирусы, их аналоги, трояны, логические бомбы, иные вредоносные программы и данные.</p>
                  <p>10.3 Отправление сообщений и распространение информации, содержащих оскорбление, агрессию, клевету, дискриминацию, призывы к насилию, непристойности, ненависти или расизму, а также всем, что может быть истолковано как таковое.</p>
                  <p>10.4 Разжигание национальной розни, призывы к террористической деятельности, насилия.</p>
                  <p>10/5 Призывы к грубому обращению или совершению действий, унижающих человеческое достоинство, в отношении кого бы то ни было, вне зависимости от его расовой принадлежности, возраста, пола, национальности, вероисповедания, внешности, физических и интеллектуальных возможностей.</p>
                  <p>10.6 Адресация каких-либо высказываний в адрес лиц, не достигших 18 лет или совершение действий, направленных на организацию знакомства и/или встречи с лицами, не достигшими 18 лет, или способных явиться причиной таких знакомства и/или встречи.</p>
                  <p>10.7 Распространение любых запрещенных материалов, публикация ссылок на запрещенные сайты, либо сайты и любые другие информационные материалы, содержащие сведения, указанные в пп. 3.3-3.4 Соглашения.</p>
                  <p>10.8 Совершение действий, имеющих целью или способных стать причиной причинения ущерба Сайту, Администрации либо собственникам Сайта.</p>
                  <p>10.9 Совершение любых действий, направленных или способных стать следствием нарушения гражданского, уголовного, административного законодательства, а также призывы к таким действиям, их провокация и пропаганда.</p>
                </div>
              </p>
              <p>11. Администрация Сайта оставляет за собой и отдельно оговаривает свое право, в случае, если кому-либо из сотрудников Администрации станет известно о совершении Пользователем действий, указанных в п.3.10 Соглашения, передачи информации о таких действиях и персональных данных Пользователей, связанных с такими действиями, в компетентные государственные органы. </p>
              <p>12. Разрешено использование Сайта только в соответствии с законодательством РФ и статьи Соглашения «Применимое право».</p>
              <p>13. Запрещено использование программного обеспечения и технических средств, предназначенных для автоматизации процесса использования Сайта, а также любого программного обеспечения за исключением интернет-браузеров.</p>
              <p>14. Администрация имеет право, с вынесением предварительного предупреждения или без такового, в любой момент времени заблокировать Пользователю доступ к Сайту, независимо от его согласия и/или наличия каких-либо нарушений Соглашения, без объяснения причин. При этом платные услуги, указанные в ст. 7 Соглашения, будут считаться оказанными качественно и в полном объеме.</p>
              <p>15. Администрация имеет право хранить и обрабатывать персональные данные Пользователей в соответствии с Политикой конфиденциальности, а также получать доступ к персональной странице Пользователя на Сайте, его входящим и исходящим сообщениям, фото и т.д. без получения предварительного согласия Пользователя.</p>
              <p>16. Администрация имеет право удалить в любой момент времени любую информацию и материалы, размещенные Пользователем, без его согласия и объяснения причин.</p>
              <p>17. Администрация имеет право ограничивать Пользователю доступ к использованию Сайта как полностью, так и частично.</p>
              <p>18. Разрешено размещение фото-материалов, на которых изображены исключительно Пользователь. Все фотографии, размещенные Пользователем на Сайте, будут модерироваться Администрацией, при этом Администрация оставляет за собой право удалить любые, в том числе все, фотографии Пользователя без объяснения причин.</p>
              <p>19. Администрация вправе устанавливать лимиты по объему и составу размещаемых Пользователем информационных материалов, а также вводить иные технические ограничения использования Сайта, которые время от времени будут доводиться до сведения Пользователей в форме и способом по выбору Администрации.</p>
              <p>20. Размещая фото-материалы на Сайте, Пользователь предоставляет Администрации Сайта и собственникам Сайта неограниченное право на их использование в порядке, определенном ст.4 Соглашения.</p>          
            </div>
          </v-col>
        </v-row>
        <v-scale-transition>
          <div v-if="scrolled" class="arrow-down">
            <v-icon size="2em" class="d4">mdi-arrow-down</v-icon>
          </div>
        </v-scale-transition>
      </v-content>
    </v-col>
    <div
      ref="bottom"
      class="px-4 pt-5 pb-3"
      style="box-shadow: inset 0px 4px 4px rgba(0, 0, 0, 0.25)"
    >
      <div class="d-flex justify-center">
        <v-btn
          nuxt
          :to="confirm ? '/registrate/confirm': '/'"
          depressed
          color="primary"
          min-height="44"
          class="text-none font-weight-bold"
          min-width="250"
        >Продолжить</v-btn>
      </div>
      <div class="pt-5 caption black--text"  style="line-height:15px; font-family: 'Montserrat', sans-serif !important;">
        Нажимая кнопку “Продолжить” вы подтверждаете, что вы старше 18 лет и соглашаетесь с
        <a
          href = "https://www.barev.ru/legal/rules-and-privacy-policy/ru.html"
          class="black--text"
        >Полными&nbsp;условиями использования сервиса</a>
      </div>
    </div>
  </v-row>
</template>

<script>
import { scrolling } from '~/mixins'

export default {
  head: {
    title: 'Пользовательское соглашение'
  },
  name: 'TermsPage',
  mixins: [scrolling],
  data: () => ({
    target: '#scroll-target',
    confirm: false
  }),
  mounted() {
    this.confirm = this.$route.query.confirm || false
  }
}
</script>

<style lang="scss" scoped>
.arrow-down {
  position: fixed;
  bottom: 160px;
  right: 6px;
}
.d4 {
  color: #d4d4d4;
}
</style>